# Dataset Loading

In [20]:
import pandas as pd
import numpy as np

## Define Dataset

In [21]:
data=pd.read_csv("dirty_dataset.csv")
data.head()

    ID   Name   Age     City   Salary
0  353  Sneha  23.0      NaN  35000.0
1  690  Sneha  22.0  Kolkata  25000.0
2  486  Sneha  25.0  Kolkata  40000.0
3  389   Amit  25.0   Mumbai  25000.0
4   32  Rohan  23.0   Mumbai  40000.0

In [22]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1050 entries, 0 to 1049
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      1050 non-null   int64
 1   Name    905 non-null    object
 2   Age     901 non-null    float64
 3   City    880 non-null    object
 4   Salary  872 non-null    float64
dtypes: float64(2), int64(1), object(2)
memory usage: 41.1+ KB

In [23]:
data.shape

(1050, 5)

In [24]:
data.describe()

                ID         Age        Salary
count  1050.000000  901.000000    872.000000
mean    502.380952   22.473918  35149.082569
std     288.838378    1.736099   7089.765530
min       1.000000   20.000000  25000.000000
25%     253.250000   21.000000  30000.000000
50%     503.500000   22.000000  35000.000000
75%     751.750000   24.000000  40000.000000
max    1000.000000   25.000000  45000.000000

### Check Missing Values

In [25]:
data.isnull().sum()

ID          0
Name      145
Age       149
City      170
Salary    178
dtype: int64

### Fill Missing Values One By One

In [26]:
data['Age']=data['Age'].fillna(data['Age'].median())

In [27]:
data['Age'].isnull().sum()

np.int64(0)

In [28]:
data['Salary']=data['Salary'].fillna(data['Salary'].median())
data.head()

    ID   Name   Age     City   Salary
0  353  Sneha  23.0      NaN  35000.0
1  690  Sneha  22.0  Kolkata  25000.0
2  486  Sneha  25.0  Kolkata  40000.0
3  389   Amit  25.0   Mumbai  25000.0
4   32  Rohan  23.0   Mumbai  40000.0

In [29]:
data['City']=data['City'].fillna(data['City'].mode()[0])
data['City'].unique()

array(['Chennai', 'Kolkata', 'Mumbai', 'Bangalore', 'Delhi'], dtype=object)

In [30]:
data['Name']=data['Name'].fillna(data['Name'].mode()[0])
data.isnull().sum()

ID        0
Name      0
Age       0
City      0
Salary    0
dtype: int64

###  Check Duplicates

In [31]:
data.duplicated().sum()

np.int64(50)

### Remove Duplicates

In [32]:
df=data.drop_duplicates()

In [33]:
df.duplicated().sum()

np.int64(0)

In [34]:
df.head()

    ID   Name   Age     City   Salary
0  353  Sneha  23.0  Chennai  35000.0
1  690  Sneha  22.0  Kolkata  25000.0
2  486  Sneha  25.0  Kolkata  40000.0
3  389   Amit  25.0   Mumbai  25000.0
4   32  Rohan  23.0   Mumbai  40000.0

In [35]:
df.isnull().sum()

ID        0
Name      0
Age       0
City      0
Salary    0
dtype: int64

## âœ… Dirty Dataset Cleaned

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1000 entries, 0 to 1049
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      1000 non-null   int64
 1   Name    1000 non-null   object
 2   Age     1000 non-null   float64
 3   City    1000 non-null   object
 4   Salary  1000 non-null   float64
dtypes: float64(2), int64(1), object(2)
memory usage: 46.9+ KB

In [37]:
df.head()

    ID   Name   Age     City   Salary
0  353  Sneha  23.0  Chennai  35000.0
1  690  Sneha  22.0  Kolkata  25000.0
2  486  Sneha  25.0  Kolkata  40000.0
3  389   Amit  25.0   Mumbai  25000.0
4   32  Rohan  23.0   Mumbai  40000.0

## Now the dataset is clean:
##### Missing values handled
##### Duplicates removed
##### Redundant columns dropped

In [38]:
!git init

Reinitialized existing Git repository in C:/Data Science/Data_Cleaning/.git/

In [39]:
!git remote add origin "https://github.com/Sumitmishra7367/Data-Cleaning-Examples.git"

error: remote origin already exists.

In [40]:
!git remote -v

origin	https://github.com/Sumitmishra7367/Data_Cleaning_Projects.git (fetch)
origin	https://github.com/Sumitmishra7367/Data_Cleaning_Projects.git (push)

In [41]:
!git remote set-url origin "https://github.com/Sumitmishra7367/Data-Cleaning-Examples.git"

In [42]:
!git remote -v

origin	https://github.com/Sumitmishra7367/Data-Cleaning-Examples.git (fetch)
origin	https://github.com/Sumitmishra7367/Data-Cleaning-Examples.git (push)

In [43]:
!git add .

In [45]:
!git commit -m "first commit"

[main 1b67450] first commit

In [46]:
!git branch -M main

In [47]:
!git push -u origin main

branch 'main' set up to track 'origin/main'.

To https://github.com/Sumitmishra7367/Data-Cleaning-Examples.git
 * [new branch]      main -> main